app/controllers/authors_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def show
    @project = Project.find(params[:project_id])