app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def show
    @projects = Project.all
    @project =Project.find(params[:id])
---
SELECT * FROM `projects`
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def new
    @projects = Project.all
---
SELECT * FROM `projects`

  def edit
    @projects = Project.all
    @project = Project.find(params[:id])
---
SELECT * FROM `projects`
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`updated_at`, `title`, `description`, `created_at`) VALUES('2010-02-18 02:02:10', 'ABC Company', 'ABC Company project', '2010-02-18 02:02:10')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `author_id` = 2, `updated_at` = '2010-02-18 09:13:38' WHERE `id` = 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1