app/controllers/tasks_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def index
    @project = Project.find(params[:project_id])

SELECT * FROM `projects`
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1 AND (`tasks`.project_id = 1))
---
  def show
    @projects = Project.all
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

SELECT * FROM `projects`
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def new
    @projects = Project.all
    @project = Project.find(params[:project_id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
INSERT INTO `tasks` (`project_id`, `updated_at`, `title`, `description`, `author_id`, `created_at`) VALUES(1, '2010-02-19 00:35:31', 'Go to the post office', 'Go to the post office near Shinbashi', NULL, '2010-02-19 00:35:31')
---
  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.build(params[:task])
    if @task.save

SELECT * FROM `projects`
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1 AND (`tasks`.project_id = 1))
---
  def edit
    @projects = Project.all
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
UPDATE `tasks` SET `title` = 'task1', `priority` = 'High', `updated_at` = '2010-02-22 05:10:14' WHERE `id` = 3
---
  def update
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:id])
    if @task.update_attributes(params[:task])

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 7)
DELETE FROM `tasks` WHERE `id` = 7
---
  def destroy
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:id])
    @task.destroy