app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_login_at`, `updated_at`, `last_request_at`, `crypted_password`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `login`, `created_at`, `last_login_ip`) VALUES(NULL, '2010-02-22 07:59:14', '2010-02-22 07:59:14', 'dd62e9a09f0e1e545505ccc521db52a71538f784d186694297d84ea1b059d36ca190c98d79fe0bb4469876b9fdc097cd237b40b7a4b94d68d2454214c01cb901', '127.0.0.1', 'KYOcL3psgQ5o52cUThbs', '2010-02-22 07:59:12', '4f4af6689a5846248bda18a6c642ac3873784eafd9baaf4b6846d9bf14d24df62df2b0f1a581a8138e04809588be987ca46ad72705b7f3f4739e7b62061072d5', 1, 'admin', '2010-02-22 07:59:14', NULL)